// @strict-types

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьДанные(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СгенерироватьДанныеНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьКлиентов(Команда)
	ЗагрузитьКлиентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКлиентовНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьКлиентов();
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьПогоду(Команда)
	ЗагрузитьПогодуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПогодуНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьПогоду();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СгенерироватьДанныеНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СгенерироватьДанные();

КонецПроцедуры

#КонецОбласти
